app/Http/Controllers/ProductController.php

    public function index(Request $request)
    {
        $products = new Product();
        if ($request->search) {
            $products = $products->where('name', 'LIKE', "%{$request->search}%");
        }
        $products = $products->latest()->paginate(10);
---
select * from `products` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `products`